Проект про обучения нейронной сети для прохождения Geometry Dash который создан при помощи pygame.
Нейросеть работает по принципу нейроэволюции
Выбор лучшего куба происходит по принцу лучшего результата из нынешнего поколения, в дальнейшем лучший куб используеться для размножения
В качевстве входных даннных используеться дистанция до ближайшего препятствия(ось х) и ширина данного преятсвия и разница в высоте между аватаром и ближайшим шипом(ось у)
Уровни созданы с помощью Tiled Map Editor

Для работы нужны библиотеки Pygame и Neat
